#include <stdio.h>
#define N 100

//计算2的100次方
//假设计算结果有n位，a[0]保存个位，a[1]保存十位..a[n-1]保存最高位

int main()
{
    int i ,j= 0;
    int n = 1;
    int a[N] = {0}; //存储计算结果
    a[0] =1;
    //n次循环
    for(i=1;i<=N;i++)  
    {
        //每次循环将上次存储的a[0]~a[n-1]位的数字乘2
        for(j=n-1;j>=0;j--)
        {
            a[j] *= 2; //计算次方
        }
        //检查乘2以后的数值是否需要向相邻高位借位
        for(j=0;j<n;j++)
        {
            a[j+1] += a[j]/10; //进位
            a[j] %= 10;  //原位置上的应该%10 取余
        }
        //检查进位后原来数据位a[n-1]的相邻高位a[n]是否有值，若有则数据位增1
        if(a[n]) 
            n++;
    }
    for(i=n-1;i>=0;i--)
        printf("%d ", a[i]);
    printf("\n");
}